using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace RevolutionCAD.Placement
{
    public class BranchesAndBorders
    {

        static Matrix<int> matrR;

        public static List<StepPlacementLog> Place()
        {
            // создаём класс для логирования (обязательно)
            var log = new List<StepPlacementLog>();

            // создаём список с матрицами для каждого узла
            var boards = new List<Matrix<int>>();

            var boardMatr = new Matrix<int>(2, 2);

            boardMatr.Fill(-1);

            // добавляем в общий список плат новую матрицу платы, в которую будем на этом шаге заносить элементы
            boards.Add(boardMatr);


            //boardMatr

            // начинаем логирование действия

            string msg = "r = {4 3 2 1 1 0}\n" +
                "d = {1 1 1 1 2 2} \n" +
                "r х d = 4 + 3 + 2 + 1 + 2 + 0 = 12. \n" +
                "Значение целевой функции F(P) не может быть меньше 12.\n";
            var step = new StepPlacementLog(boards, msg);
            log.Add(step);


            boardMatr[0, 0] = 1;
            msg = "Помещаем элемент e1 в позицию р1 \n" +
                "Размещен 1 элемент: F(q) = 0. \n" +
                "Неразмещенные элементы {e2, e3, e4}, свободные позиции {р2, р3, р4}\n" +
                "r1 = {4 3 1} и d1 = {1 1 2}; r1 х d1 =  4 + 3 + 2 = 9 \n" +
                "w(P) =  9; \n" +
                "r = {2 1 0} и d = {1 1 2}; v(P) = r х d = 2 + 1 + 0 = 3;\n" +
                "v(P) = r х d = 2 + 1 + 0 = 3;\n" +
                "F(P) = 0 + 9 + 3 = 12.\n\n" +
                "Помещаем элемент e1 в позицию р2\n" +
                "Размещен 1 элемент: F(q) = 0.\n" +
                "Неразмещенные элементы {e2, e3, e4}, свободные позиции {р1, р3, р4}.\n" +
                "r1 = {4 3 1} и d2 = {1 1 2}; r1 x d2 =  4 + 3 + 2 = 9; \n" +
                "w(P) =  9;\n" +
                "r = {2 1 0} и d= {1 1 2}; v(P) = r x d = 2 + 1 + 0 = 3;\n" +
                "F(P) = 0 + 9 + 3 = 12.\n\n" +
                "Помещаем элемент e1 в позицию р3 \n" +
                "Размещен 1 элемент: F(q) = 0.\n" +
                "Неразмещенные элементы {e2, e3, e4}, свободные позиции {р1, р2, р4}.\n" +
                "r1 = {4 3 1} и d3 = {1 1 2}; r1 х d3 =  4 + 3 + 2 = 9;\n" +
                "w(P) =  9; \n" +
                "r = {2 1 0} и d = {1 1 2}; v(P) = r х d = 2 + 1 + 0 = 3;\n" +
                "v(P) = r х d = 2 + 1 + 0 = 3;\n" +
                "F(P) = 0 + 9 + 3 = 12.\n\n" +
                "Помещаем элемент e1 в позицию р4\n" +
                "Размещен 1 элемент: F(q) = 0.\n" +
                "Неразмещенные элементы {e2, e3, e4}, свободные позиции {р1, р2, р3}.\n" +
                "r1 = {4 3 1} и d4 = {1 1 2}; r1 x d4 =  4 + 3 + 2 = 9; \n" +
                "w(P) =  9;\n" +
                "r = {2 1 0} и d= {1 1 2}; v(P) = r x d = 2 + 1 + 0 = 3;\n" +
                "F(P) = 0 + 9 + 3 = 12.\n\n" +
                "Минимальное значение F(P) в 1 позиции\n" +
                "Помещаем его в 1 позицию на 1 плату";
            step = new StepPlacementLog(boards, msg);
            log.Add(step);


            boardMatr[1, 1] = 2;
            msg = "Помещаем элемент e2 в позицию р2. \n" +
                "Размещены 2 элемента: e1 в р1, e2 в р2, F(q) = r12 d12 = 1.\n" +
                "Неразмещенные элементы {e3, e4}, свободные позиции {р3, р4};\n" +
                "r1 ={4 3}  и  d1 ={1 2}; r1 x d1 = 4 + 6 = 10;\n" +
                "r2 ={2 0}  и  d2 ={1 2}; r2 x d2 = 2 + 0 = 2;\n" +
                "w(P) = 10 + 2 = 12.\n" +
                "r = {1} и d = {1}; v(P) = r х d = 1;\n" +
                "F(P) = 1 + 12 + 1 = 14.\n" +
                "Помещаем элемент e2 в позицию р3. \n" +
                "Размещены 2 элемента: e1 в р1, e2 в р3, F(q) = r12 d13 = 1.\n" +
                "Неразмещенные элементы {e3, e4}, свободные позиции {р2, р4};\n" +
                "r1 ={4 3}  и  d1 ={1 2}; r1 x d1 = 4 + 6 = 10;\n" +
                "r2 ={2 0}  и  d3 ={1 2}; r2 x d3 = 2 + 0 = 2;\n" +
                "w(P) = 10 + 2 = 12.\n" +
                "r = {1} и d = {1}; v(P) = r х d = 1;\n" +
                "F(P) = 1 + 12 + 1 = 14.\n" +
                "Помещаем элемент e2 в позицию р4. \n" +
                "Размещены 2 элемента: e1 в р1, e2 в р4, F(q) = r12 d14 = 2.\n" +
                "Неразмещенные элементы {e3, e4}, свободные позиции {р2, р3};\n" +
                "r1 ={4 3}  и  d1 ={1 1}; r1 x d1 = 4 + 3 = 7;\n" +
                "r2 ={2 0}  и  d4 ={1 1}; r2 x d4 = 2 + 0 = 2;\n" +
                "w(P) = 7 + 2 = 9.\n" +
                "r = {1} и d = {2}; v(P) = r х d = 2;\n" +
                "F(P) = 1 + 12 + 1 = 13.\n" +
                "Минимальное значение F(P) в 4 позиции\n" +
                "Помещаем его в 4 позицию на 1 плату";
            step = new StepPlacementLog(boards, msg);
            log.Add(step);


            boardMatr[0,1] = 3;
            msg = "Помещаем элемент e3 в позицию р2. \n" +
                "Размещены 3 элемента: e1 в р1, e2 в р4, e3 в р2, F(q) = r12d14 + r13d12 + r23d42 = 2 + 3 + 2 = 7.\n" +
                "Неразмещенный элемент {e4}, свободная позиция {р3};\n" +
                "r1 = {4} и d1 = {1}; r1 x d1 = 4;\n" +
                "r2 = {0} и d4 = {1}; r2 x d4 = 0;\n" +
                "r3 = {1} и d2 = {2}; r3 x d2 = 2;\n" +
                "w(P) = 4 + 0 + 2 = 6. \n" +
                "Неразмещенный элемент один, v(P) = 0;\n" +
                "F(P) = 7 + 6 + 0 = 13.\n" +
                "Помещаем элемент e3 в позицию р3. \n" +
                "Размещены 3 элемента: e1 в р1, e2 в р4, e3 в р3, F(q) = r12d14 + r13d13 + r23d43 = 2 + 3 + 2 = 7.\n" +
                "Неразмещенный элемент {e4}, свободная позиция {р2}; \n" +
                "r1 = {4} и d1 = {1}; r1 x d1 = 4;\n" +
                "r2 = {0} и d4 = {1}; r2 x d4 = 0;\n" +
                "r3 = {1} и d3 = {2}; r3 x d3 = 2;\n" +
                "w(P) = 4 + 0 + 2 = 6. \n" +
                "Неразмещенный элемент один, v(P) = 0;\n" +
                "F(P) = 7 + 6 + 0 = 13.\n" +
                "Минимальное значение F(P) в 2 позиции\n" +
                "Помещаем его в 2 позицию на 1 плату";
            step = new StepPlacementLog(boards, msg);
            log.Add(step);


            boardMatr[1, 0] = 4;
            msg = "Помещаем элемент e4 в позицию р3.\n" +
                "Размещены 4 элемента: e1 в р1, e2 в р4, e3 в р2, e4 в 3, F(q) = r12d14 + r13d12 + r23d42 + r14d13 + r24d43 + r34d23 = 2 + 3 + 2 + 4 + 0 + 2 = 13.\n" +
                "Неразмещенного элемента нет, свободных позиций нет;\n" +
                "w(P) = 0;\n" +
                "Неразмещенного элемента нет, v(P) = 0;\n" +
                "F(P) = 13 + 0 + 0 = 13.\n" +
                "Минимальное значение F(P) в 3 позиции\n" +
                "Помещаем его в 3 позицию на 1 плату";
            step = new StepPlacementLog(boards, msg);
            log.Add(step);

            return log;
        }

    }
}
